In [4]:
import pandas as pd
alunos = {'Nome': ["Ricardo", "Pedro", "Roberto", "Carlos"],
         'Nota' : [4, 5.5, 7, 9],
         'Aprovado' : ['Não', 'Não', 'Sim', 'Sim']}

In [5]:
dataframe = pd.DataFrame(alunos)

In [7]:
print(dataframe)

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   5.5      Não
2  Roberto   7.0      Sim
3   Carlos   9.0      Sim

In [10]:
dataframe['Nota']

0    4.0
1    5.5
2    7.0
3    9.0
Name: Nota, dtype: float64

In [14]:
dataframe.loc[[0, 2]]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
2  Roberto   7.0      Sim

In [15]:
dataframe.loc[0:2]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   5.5      Não
2  Roberto   7.0      Sim

In [16]:
dataframe.loc[dataframe['Nome'] == 'Pedro']

    Nome  Nota Aprovado
1  Pedro   5.5      Não

In [17]:
dataframe.loc[dataframe['Nota'] == 9]

     Nome  Nota Aprovado
3  Carlos   9.0      Sim